In [1]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2
from psycopg2.extras import execute_values

In [2]:
region_df = pd.read_csv('Region-Lookup.csv')
store_df = pd.read_csv('Store-Lookup.csv')
product_df = pd.read_csv('Product-Lookup.csv')
customer_all_df = pd.read_csv('Customer-Lookup.csv')
transaction_1997_df = pd.read_csv('FoodMart-Transactions-1997.csv')
transaction_1998_df = pd.read_csv('FoodMart-Transactions-1998.csv')
return_df = pd.read_csv('FoodMart-Returns-1997-1998.csv')

In [3]:
transaction_df = pd.merge(transaction_1997_df, transaction_1998_df,
                          on=['transaction_date', 'stock_date', 'product_id', 'customer_id', 'store_id', 'quantity'], how='outer')

### Connect to Database

In [4]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/SQL_Project'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

conn = psycopg2.connect(
    host="localhost",
    port='5432',
    dbname="SQL_Project",
    user="postgres",
    password="123")

# create a cursor
cur = conn.cursor()

### Test the Connection

In [5]:
# Execute a statement
print('PostgreSQL database version:')
cur.execute('SELECT version()')

# Display the PostgreSQL database server version
db_version = cur.fetchone()
print(db_version)

PostgreSQL database version:
('PostgreSQL 16.2 (Debian 16.2-1.pgdg120+2) on x86_64-pc-linux-gnu, compiled by gcc (Debian 12.2.0-14) 12.2.0, 64-bit',)

In [6]:
# Pass the SQL statements that create all tables
# Add DROP TABLE CASCADE to ensure that there's no error occur when rerunning the codes
stmt = """
    DROP TABLE region CASCADE;
    DROP TABLE store CASCADE;
    DROP TABLE Product_Lookup CASCADE;
    DROP TABLE Customers CASCADE;
    DROP TABLE Customer_Accounts CASCADE;
    DROP TABLE Customer_Address CASCADE;
    DROP TABLE transactions CASCADE;
    DROP TABLE Returns CASCADE;
    
    CREATE TABLE region (
        region_id 			    INT PRIMARY KEY,
        sales_district 			VARCHAR(255),
        sales_region 			VARCHAR(255)
    );
    
    CREATE TABLE store (
        store_id 			    INT PRIMARY KEY,
        region_id 			    INT,
        store_type 			    VARCHAR(255),
        store_name 			    VARCHAR(255),
        store_street_address 	VARCHAR(255),
        store_city 			    VARCHAR(255),
        store_state 			VARCHAR(255),
        store_country 			VARCHAR(255),
        store_phone 			VARCHAR(255),
        first_opened_date 		DATE,
        last_remodel_date 		DATE,
        total_sqft 			    INT,
        grocery_sqft 			INT,
        FOREIGN KEY (region_id) REFERENCES region(region_id)
    );
    
    CREATE TABLE Product_Lookup (
        product_id			    INT PRIMARY KEY,
        product_brand 		    VARCHAR(255),
        product_name 		    VARCHAR(255),
        product_sku 			BIGINT,
        product_retail_price 	DECIMAL(10, 2),
        product_cost 			DECIMAL(10, 2),
        product_weight 		    DECIMAL(10, 2),
        recyclable 			    INT,
        low_fat 			    INT
    );
    
    CREATE TABLE Customers (
        customer_id 			INT PRIMARY KEY,
        first_name 			    VARCHAR(255),
        last_name 			    VARCHAR(255),
        birthdate 			    DATE,
        marital_status 			CHAR(1),
        yearly_income 		    VARCHAR(255),
        gender 			        CHAR(1),
        total_children 			INT,
        num_children_at_home 	INT,
        education 		        VARCHAR(255),
        member_card 		    VARCHAR(255),
        occupation			    VARCHAR(255),
        homeowner 			    CHAR(1)
    );
    
    CREATE TABLE Customer_Accounts (
        account_id 			    INT PRIMARY KEY,
        customer_acct_num 	    BIGINT,
        customer_id 		    INT,
        acct_open_date 		    DATE,
        FOREIGN KEY (customer_id) REFERENCES Customers(customer_id)
    );
    
    CREATE TABLE Customer_Address (
        address_id 			    INT PRIMARY KEY,
        customer_id 			INT,
        customer_address 		VARCHAR(255),
        customer_city 			VARCHAR(255),
        customer_state_province	VARCHAR(255),
        customer_postal_code 	INT,
        customer_country 		VARCHAR(255),
        FOREIGN KEY (customer_id) REFERENCES Customers(customer_id)
    );
    
    CREATE TABLE transactions(
    	transaction_date		DATE,
    	stock_date			    DATE,
    	product_id		     	INT,
    	customer_id			    INT,
    	store_id			    INT,
    	quantity			    INT,
    	FOREIGN KEY (product_id) REFERENCES Product_Lookup(product_id),
    	FOREIGN KEY (customer_id) REFERENCES Customers(customer_id),
    	FOREIGN KEY (store_id) REFERENCES store(store_id)
    );
    
    CREATE TABLE Returns (
    	return_date				DATE NOT NULL,
    	product_id				INT NOT NULL,
    	store_id				INT NOT NULL,
    	quantity				VARCHAR(255) NOT NULL,
    	PRIMARY KEY (product_id, store_id),
    	FOREIGN KEY (product_id) REFERENCES Product_Lookup(product_id),
    	FOREIGN KEY (store_id) REFERENCES store(store_id)
    );
    """

In [7]:
cur.execute(stmt)
conn.commit()

### Intert Data

#### "region"

In [8]:
region_df.head()

   region_id sales_district    sales_region
0          1  San Francisco    Central West
1          2    Mexico City  Mexico Central
2          3    Los Angeles      South West
3          4    Guadalajara     Mexico West
4          5      Vancouver     Canada West

In [9]:
insert = """
INSERT INTO region (region_id, sales_district, sales_region) VALUES %s
ON CONFLICT (region_id) DO NOTHING;
"""

In [10]:
region_data = list(region_df.itertuples(index=False, name=None))
execute_values(cur, insert, region_data)
conn.commit()

In [11]:
# Examine the table
pd.read_sql_query("SELECT * FROM region LIMIT 5;", engine)

   region_id sales_district    sales_region
0          1  San Francisco    Central West
1          2    Mexico City  Mexico Central
2          3    Los Angeles      South West
3          4    Guadalajara     Mexico West
4          5      Vancouver     Canada West

#### "store"

In [12]:
store_df.head()

,store_id,region_id,store_type,store_name,store_street_address,store_city,store_state,store_country,store_phone,first_opened_date,last_remodel_date,total_sqft,grocery_sqft
0,1,28,Supermarket,Store 1,2853 Bailey Rd,Acapulco,Guerrero,Mexico,262-555-5124,1/9/1982,12/5/1990,23593,17475
1,2,78,Small Grocery,Store 2,5203 Catanzaro Way,Bellingham,WA,USA,605-555-8203,4/2/1970,6/4/1973,28206,22271
2,3,76,Supermarket,Store 3,1501 Ramsey Circle,Bremerton,WA,USA,509-555-1596,6/14/1959,11/19/1967,39696,24390
3,4,27,Gourmet Supermarket,Store 4,433 St George Dr,Camacho,Zacatecas,Mexico,304-555-1474,9/27/1994,12/1/1995,23759,16844
4,5,4,Small Grocery,Store 5,1250 Coggins Drive,Guadalajara,Jalisco,Mexico,801-555-4324,9/18/1978,6/29/1991,24597,15012

In [13]:
insert = """
INSERT INTO store (store_id, region_id, store_type, store_name, store_street_address, store_city, store_state, store_country,
                    store_phone, first_opened_date, last_remodel_date, total_sqft, grocery_sqft) VALUES %s
"""

In [14]:
store_data = list(store_df.itertuples(index=False, name=None))
execute_values(cur, insert, store_data)
conn.commit()

In [15]:
# Examine the table
pd.read_sql_query("SELECT * FROM store LIMIT 5;", engine)

,store_id,region_id,store_type,store_name,store_street_address,store_city,store_state,store_country,store_phone,first_opened_date,last_remodel_date,total_sqft,grocery_sqft
0,1,28,Supermarket,Store 1,2853 Bailey Rd,Acapulco,Guerrero,Mexico,262-555-5124,1982-01-09,1990-12-05,23593,17475
1,2,78,Small Grocery,Store 2,5203 Catanzaro Way,Bellingham,WA,USA,605-555-8203,1970-04-02,1973-06-04,28206,22271
2,3,76,Supermarket,Store 3,1501 Ramsey Circle,Bremerton,WA,USA,509-555-1596,1959-06-14,1967-11-19,39696,24390
3,4,27,Gourmet Supermarket,Store 4,433 St George Dr,Camacho,Zacatecas,Mexico,304-555-1474,1994-09-27,1995-12-01,23759,16844
4,5,4,Small Grocery,Store 5,1250 Coggins Drive,Guadalajara,Jalisco,Mexico,801-555-4324,1978-09-18,1991-06-29,24597,15012

#### "Product_Lookup"

In [16]:
product_df = product_df.fillna(0)
product_df['recyclable'] = product_df['recyclable'].astype(int)
product_df['low_fat'] = product_df['low_fat'].astype(int)

In [17]:
product_df.head()

,product_id,product_brand,product_name,product_sku,product_retail_price,product_cost,product_weight,recyclable,low_fat
0,1,Washington,Washington Berry Juice,90748583674,2.85,0.94,8.39,0,0
1,2,Washington,Washington Mango Drink,96516502499,0.74,0.26,7.42,0,1
2,3,Washington,Washington Strawberry Drink,58427771925,0.83,0.40,13.10,1,1
3,4,Washington,Washington Cream Soda,64412155747,3.64,1.64,10.60,1,0
4,5,Washington,Washington Diet Soda,85561191439,2.19,0.77,6.66,1,0

In [18]:
insert = """
INSERT INTO Product_Lookup (product_id, product_brand, product_name, product_sku, product_retail_price, 
                            product_cost, product_weight, recyclable, low_fat) VALUES %s
"""

In [19]:
product_data = list(product_df.itertuples(index=False, name=None))
execute_values(cur, insert, product_data)
conn.commit()

In [20]:
# Examine the table
pd.read_sql_query("SELECT * FROM Product_Lookup LIMIT 5;", engine)

,product_id,product_brand,product_name,product_sku,product_retail_price,product_cost,product_weight,recyclable,low_fat
0,1,Washington,Washington Berry Juice,90748583674,2.85,0.94,8.39,0,0
1,2,Washington,Washington Mango Drink,96516502499,0.74,0.26,7.42,0,1
2,3,Washington,Washington Strawberry Drink,58427771925,0.83,0.40,13.10,1,1
3,4,Washington,Washington Cream Soda,64412155747,3.64,1.64,10.60,1,0
4,5,Washington,Washington Diet Soda,85561191439,2.19,0.77,6.66,1,0

### "Customers", "CustomerAccounts", "CustomerAddress"

In [21]:
customer_df = customer_all_df[['customer_id', 'first_name', 'last_name', 'birthdate', 'marital_status', 'yearly_income', 'gender', 'total_children',
                               'num_children_at_home', 'education', 'member_card', 'occupation', 'homeowner']]
account_df = customer_all_df[['customer_acct_num', 'customer_id', 'acct_open_date']]
address_df = customer_all_df[['customer_id', 'customer_address', 'customer_city', 'customer_state_province', 'customer_postal_code', 'customer_country']]

In [22]:
# "Customers"
customer_df.head()

,customer_id,first_name,last_name,birthdate,marital_status,yearly_income,gender,total_children,num_children_at_home,education,member_card,occupation,homeowner
0,1,Sheri,Nowmer,8/26/1961,M,$30K - $50K,F,4,2,Partial High School,Bronze,Skilled Manual,Y
1,2,Derrick,Whelply,7/3/1915,S,$70K - $90K,M,1,0,Partial High School,Bronze,Professional,N
2,3,Jeanne,Derry,6/21/1910,M,$50K - $70K,F,1,1,Bachelors Degree,Bronze,Professional,Y
3,4,Michael,Spence,6/20/1969,M,$10K - $30K,M,4,4,Partial High School,Normal,Skilled Manual,N
4,5,Maya,Gutierrez,5/10/1951,S,$30K - $50K,F,3,0,Partial College,Silver,Manual,N

In [23]:
insert = """
INSERT INTO Customers (customer_id, first_name, last_name, birthdate, marital_status, yearly_income, gender, total_children,
                        num_children_at_home, education, member_card, occupation, homeowner) VALUES %s
"""

In [24]:
customer_data = list(customer_df.itertuples(index=False, name=None))
execute_values(cur, insert, customer_data)
conn.commit()

In [25]:
# Examine the table
pd.read_sql_query("SELECT * FROM Customers LIMIT 5;", engine)

,customer_id,first_name,last_name,birthdate,marital_status,yearly_income,gender,total_children,num_children_at_home,education,member_card,occupation,homeowner
0,1,Sheri,Nowmer,1961-08-26,M,$30K - $50K,F,4,2,Partial High School,Bronze,Skilled Manual,Y
1,2,Derrick,Whelply,1915-07-03,S,$70K - $90K,M,1,0,Partial High School,Bronze,Professional,N
2,3,Jeanne,Derry,1910-06-21,M,$50K - $70K,F,1,1,Bachelors Degree,Bronze,Professional,Y
3,4,Michael,Spence,1969-06-20,M,$10K - $30K,M,4,4,Partial High School,Normal,Skilled Manual,N
4,5,Maya,Gutierrez,1951-05-10,S,$30K - $50K,F,3,0,Partial College,Silver,Manual,N

In [26]:
# "CustomerAccount"
# Add account_id
account_df.insert(0, 'account_id', range(1, 1 + len(account_df)))

In [27]:
account_df.head()

   account_id  customer_acct_num  customer_id acct_open_date
0           1        87462024688            1      9/10/1991
1           2        87470586299            2      3/11/1993
2           3        87475757600            3      6/11/1991
3           4        87500482201            4      5/21/1994
4           5        87514054179            5      8/21/1992

In [28]:
insert = """
INSERT INTO Customer_Accounts (account_id, customer_acct_num, customer_id, acct_open_date) VALUES %s
"""

In [29]:
account_data = list(account_df.itertuples(index=False, name=None))
execute_values(cur, insert, account_data)
conn.commit()

In [30]:
# Examine the table
pd.read_sql_query("SELECT * FROM Customer_Accounts LIMIT 5;", engine)

   account_id  customer_acct_num  customer_id acct_open_date
0           1        87462024688            1     1991-09-10
1           2        87470586299            2     1993-03-11
2           3        87475757600            3     1991-06-11
3           4        87500482201            4     1994-05-21
4           5        87514054179            5     1992-08-21

In [31]:
# "CustomerAddress"
# Add address_id
address_df.insert(0, 'address_id', range(1, 1 + len(address_df)))
address_df.head()

,address_id,customer_id,customer_address,customer_city,customer_state_province,customer_postal_code,customer_country
0,1,1,2433 Bailey Road,Tlaxiaco,Oaxaca,15057,Mexico
1,2,2,2219 Dewing Avenue,Sooke,BC,17172,Canada
2,3,3,7640 First Ave.,Issaquah,WA,73980,USA
3,4,4,337 Tosca Way,Burnaby,BC,74674,Canada
4,5,5,8668 Via Neruda,Novato,CA,57355,USA

In [32]:
insert = """
INSERT INTO Customer_Address (address_id, customer_id, customer_address, customer_city, customer_state_province,
                                customer_postal_code, customer_country) VALUES %s
"""

In [33]:
address_data = list(address_df.itertuples(index=False, name=None))
execute_values(cur, insert, address_data)
conn.commit()

In [34]:
# Examine the table
pd.read_sql_query("SELECT * FROM Customer_Address LIMIT 5;", engine)

,address_id,customer_id,customer_address,customer_city,customer_state_province,customer_postal_code,customer_country
0,1,1,2433 Bailey Road,Tlaxiaco,Oaxaca,15057,Mexico
1,2,2,2219 Dewing Avenue,Sooke,BC,17172,Canada
2,3,3,7640 First Ave.,Issaquah,WA,73980,USA
3,4,4,337 Tosca Way,Burnaby,BC,74674,Canada
4,5,5,8668 Via Neruda,Novato,CA,57355,USA

#### "transactions"

In [35]:
transaction_df.head()

  transaction_date  stock_date  product_id  customer_id  store_id  quantity
0         1/1/1997  12/31/1996         869         3449         6         5
1         1/1/1997  12/31/1996        1472         3449         6         3
2         1/1/1997  12/28/1996          76         3449         6         4
3         1/1/1997  12/26/1996         320         3449         6         3
4         1/1/1997  12/25/1996           4         3449         6         4

In [36]:
insert = """
INSERT INTO transactions (transaction_date, stock_date, product_id, customer_id, store_id, quantity) VALUES %s
"""

In [37]:
transaction_data = list(transaction_df.itertuples(index=False, name=None))
execute_values(cur, insert, transaction_data)
conn.commit()

In [38]:
pd.read_sql_query("SELECT * FROM transactions LIMIT 5;", engine)

  transaction_date  stock_date  product_id  customer_id  store_id  quantity
0       1997-01-01  1996-12-31         869         3449         6         5
1       1997-01-01  1996-12-31        1472         3449         6         3
2       1997-01-01  1996-12-28          76         3449         6         4
3       1997-01-01  1996-12-26         320         3449         6         3
4       1997-01-01  1996-12-25           4         3449         6         4

#### "Returns"

In [39]:
return_df.head()

  return_date  product_id  store_id  quantity
0    1/1/1997         250         6         1
1    1/1/1997         628         6         1
2    1/1/1997         869         6         1
3    1/2/1997         469        11         1
4    1/2/1997         532        23         2

In [40]:
insert = """
INSERT INTO Returns (return_date, product_id, store_id, quantity) VALUES %s
ON CONFLICT (product_id, store_id) DO NOTHING;
"""

In [41]:
return_data = list(return_df.itertuples(index=False, name=None))
execute_values(cur, insert, return_data)
conn.commit()

In [42]:
pd.read_sql_query("SELECT * FROM Returns LIMIT 5;", engine)

  return_date  product_id  store_id quantity
0  1997-01-01         250         6        1
1  1997-01-01         628         6        1
2  1997-01-01         869         6        1
3  1997-01-02         469        11        1
4  1997-01-02         532        23        2